[33mcommit 4e2df58c83c2c45737e80342db64635bffc9b70c[m[33m ([m[1;36mHEAD[m[33m -> [m[1;32mdev[m[33m)[m
Author: Maxim Ryndin <realmaximus@mail.ru>
Date:   Sun Jan 19 21:09:03 2025 +0500

    Дополните приведенный код-4
    
    Дополните приведенный код, используя генератор, так, чтобы получить словарь result, состоящий из всех элементов словаря months , в которых ключ и значение поменялись местами.
    
    Примечание. Выводить содержимое словаря result не нужно.

[33mcommit 88d8e3b05810bcd73eba5d66dea476def61b82a5[m[33m ([m[1;31morigin/dev[m[33m)[m
Author: Maxim Ryndin <realmaximus@mail.ru>
Date:   Sat Jan 18 20:28:17 2025 +0500

    Дополните приведенный код - 3   Дополните приведенный код, используя генератор, так, чтобы получить словарь result, состоящий из всех элементов словаря favorite_numbers, значения которых являются двузначными числами.
    
    Примечание. Выводить содержимое словаря result не нужно.

[33mcommit 9fd5ea2ec702db4ff20bd5e7e8f1bff8ffef4ba1[m
Author: Maxim Ryndin <realmaximus@mail.ru>
Date:   Fri Jan 17 23:02:34 2025 +0500

    Дополните приведенный код - 2
    
    Дополните приведенный код, используя генератор, так, чтобы получить словарь result, состоящий из всех элементов словаря colors, кроме тех, у которых значением является None.
    
    Примечание. Выводить содержимое словаря result не нужно.

[33mcommit 9f00c31b4e4ece2f6421dbf73431e8497d565506[m
Author: Maxim Ryndin <realmaximus@mail.ru>
Date:   Fri Jan 17 22:41:12 2025 +0500

    Дополните приведенный код   Дополните приведенный код, используя генератор, так, чтобы получить словарь result, в котором ключом будет позиция числа в списке numbers (начиная с 0), а значением – его квадрат.
    
    Примечание. Выводить содержимое словаря result не нужно.

[33mcommit 43a0e675e91b0ed09cf27d4e4a6575a763f3917c[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Fri Jan 17 11:17:21 2025 +0500

    Delete end.txt

[33mcommit c8a25b64c31b32ae994552562c9d0ade2ec28bb2[m
Author: bob <realmaximus@mail.ru>
Date:   Fri Jan 17 11:15:42 2025 +0500

    changed

[33mcommit 8c5f024e268fd3f4ab04b7804e580f44c14aa298[m
Author: bob <realmaximus@mail.ru>
Date:   Fri Jan 17 10:57:31 2025 +0500

    add start file

[33mcommit c60a25af0186bc8e8d8928bace164c7f01fd266b[m[33m ([m[1;31morigin/main[m[33m, [m[1;31morigin/HEAD[m[33m, [m[1;32mmain[m[33m)[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Thu Jan 16 23:41:59 2025 +0500

    Delete test

[33mcommit 8d24d01d2881f6ff4cae5ab9917a5c8fb7bb2835[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Thu Jan 16 21:05:08 2025 +0500

    Create test

[33mcommit eb3a04bf462f5bcb43bc0f40385f08cc958c56d0[m
Merge: ee0ecdd 5d96ecb
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Thu Jan 16 18:36:46 2025 +0300

    Merge pull request #3 from MaximRV/voc_1
    
    Merge pull request #2 from MaximRV/main

[33mcommit ee0ecdd3ec5677ea73559b63bd79968923aa8d1d[m
Author: Maxim Ryndin <onlyrm@yandex.ru>
Date:   Thu Jan 16 19:17:59 2025 +0500

    Секретное слово
    
    Напишите программу для расшифровки секретного слова методом частотного анализа.
    
    Формат входных данных
    
    В первой строке задано зашифрованное слово. Во второй строке задано одно целое число
    n– количество букв в словаре. В следующих n строках записано, сколько раз конкретная буква алфавита встречается в этом слове – <буква>: <частота>.
    
    Формат выходных данных
    Программа должна вывести дешифрованное слово.
    
    Примечание. Гарантируется, что частоты букв не повторяются.
    
    Тестовые данные 🟢
    
    Sample Input 1:
    
    *?
    3
    а: 3
    н: 2
    с: 1
    
    Sample Output 1:
    
    ананас
    
    Sample Input 2:
    
    pop
    2
    д: 2
    е: 1
    
    Sample Output 2:
    
    дед

[33mcommit 5d96ecb1d334ca5f90ca93eff5007088e3c92d0f[m
Merge: 5656266 8358aa8
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Wed Jan 15 22:19:06 2025 +0300

    Merge pull request #2 from MaximRV/main
    
    Merge pull request #1 from MaximRV/voc_1

[33mcommit 8358aa801913290e866563a7b0a436962357c2f2[m
Merge: bf8ce23 5656266
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Wed Jan 15 22:13:35 2025 +0300

    Merge pull request #1 from MaximRV/voc_1
    
    Телефонная книга

[33mcommit 5656266a7fdac3aae0b9992d6c2a14f4648b2cdd[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Thu Jan 16 00:09:50 2025 +0500

    Телефонная книга
    
    Тимур записал телефоны всех своих друзей, чтобы автоматизировать поиск нужного номера.
    
    У каждого из друзей Тимура может быть один или более телефонных номеров. Напишите программу, которая поможет Тимуру находить все номера определённого друга.
    
    Формат входных данных
    В первой строке задано одно целое число n — количество номеров телефонов, информацию о которых Тимур сохранил в телефонной книге. В следующих n строках заданы телефоны и имена их владельцев через пробел. В следующей строке записано целое число m — количество поисковых запросов от Тимура. В следующих m строках записаны сами запросы, по одному на строке. Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.
    
    Формат выходных данных
    Для каждого запроса от Тимура выведите в отдельной строке все телефоны, принадлежащие человеку с этим именем (независимо от регистра имени). Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей строке «абонент не найден» (без кавычек).
    
    Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке, в каком они были заданы во входных данных.
    
    Примечание 2. Количество строк в ответе должно быть равно числу m.
    
    Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв русского или английского алфавита. Записи не повторяются.
    
    Тестовые данные 🟢
    
    Sample Input:
    
    3
    79184219577 Женя
    79194249271 Руслан
    79281234567 Женя
    3
    Руслан
    женя
    Рустам
    
    Sample Output:
    
    79194249271
    79184219577 79281234567
    абонент не найден

[33mcommit b6a8f62c2e027a50af55bebf7513084b9ef2c7cd[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Wed Jan 15 21:59:53 2025 +0300

    Телефонная книга
    
    Тимур записал телефоны всех своих друзей, чтобы автоматизировать поиск нужного номера.
    
    У каждого из друзей Тимура может быть один или более телефонных номеров. Напишите программу, которая поможет Тимуру находить все номера определённого друга.
    
    Формат входных данных
    В первой строке задано одно целое число
    n
    n — количество номеров телефонов, информацию о которых Тимур сохранил в телефонной книге. В следующих
    n
    n строках заданы телефоны и имена их владельцев через пробел. В следующей строке записано целое число
    m
    m — количество поисковых запросов от Тимура. В следующих
    m
    m строках записаны сами запросы, по одному на строке. Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.
    
    Формат выходных данных
    Для каждого запроса от Тимура выведите в отдельной строке все телефоны, принадлежащие человеку с этим именем (независимо от регистра имени). Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей строке «абонент не найден» (без кавычек).
    
    Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке, в каком они были заданы во входных данных.
    
    Примечание 2. Количество строк в ответе должно быть равно числу
    m
    m.
    
    Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв русского или английского алфавита. Записи не повторяются.
    
    Тестовые данные 🟢
    Sample Input:
    
    3
    79184219577 Женя
    79194249271 Руслан
    79281234567 Женя
    3
    Руслан
    женя
    Рустам
    Sample Output:
    
    79194249271
    79184219577 79281234567
    абонент не найден

[33mcommit bf8ce23fe0f5e501372263dd624791c1c8ab09d5[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Tue Jan 14 21:45:01 2025 +0500

    Анаграммы 2
    
    На вход программе подаются два предложения. Напишите программу, которая определяет, являются они анаграммами или нет. Ваша программа должна игнорировать регистр символов, знаки препинания и пробелы.
    
    Формат входных данных
    На вход программе подаются два предложения, каждое на отдельной строке.
    
    Формат выходных данных
    Программа должна вывести YES , если предложения – анаграммы и NO в противном случае.
    
    Примечание. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-. Других символов в тексте нет.
    
    Тестовые данные 🟢
    Sample Input 1:
    
    Вижу зверей
    Живу резвей
    Sample Output 1:
    
    YES
    Sample Input 2:
    
    Когда увидимся
    тогда и свидимся
    Sample Output 2:
    
    NO
    Sample Input 3:
    
    С мая весной
    сам я не свой
    Sample Output 3:
    
    YES

[33mcommit 58f3b3dd8fd8d35cd9b8ef288642acc07667633b[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Tue Jan 14 19:42:40 2025 +0300

    Страны и города
    
    На вход программе подается список стран и городов каждой страны. Затем даны названия городов. Напишите программу, которая для каждого города выводит, в какой стране он находится.
    
    Формат входных данных
    Программа получает на вход количество стран n. Далее идет n строк, каждая строка начинается с названия страны, затем идут названия городов этой страны. В следующей строке записано число m, далее идут m запросов — названия каких-то m городов, из перечисленных выше.
    
    Формат выходных данных
    
    Программа должна вывести название страны, в которой находится данный город в соответствии с примером.
    
    Тестовые данные 🟢
    
    Sample Input:
    
    2
    Германия Берлин Мюнхен Гамбург Дортмунд
    Нидерланды Амстердам Гаага Роттердам Алкмар
    4
    Амстердам
    Алкмар
    Гамбург
    Гаага
    
    Sample Output:
    
    Нидерланды
    Нидерланды
    Германия
    Нидерланды

[33mcommit 8e067cad33c419f0a01607210ce017a5e318b219[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Mon Jan 13 22:17:00 2025 +0500

    Delete 10_Словари/w

[33mcommit 3eb065fdc11b49e60d0d0e8451ef3551a0ed5bb6[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Sun Jan 12 23:57:20 2025 +0300

    Update w

[33mcommit 0d4dad50f65fd88efa44524b7585e767d1e58020[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Sun Jan 12 00:36:23 2025 +0300

    Update w

[33mcommit 85dbbe1131201c70485d67fb40687c48c27cf269[m
Author: Maxim Ryndin <150359327+MaximRV@users.noreply.github.com>
Date:   Fri Jan 10 19:15:30 2025 +0500

    Словарь синонимов
    
    Вам дан словарь, состоящий из пар слов-синонимов. Повторяющихся слов в словаре нет. Напишите программу, которая для одного данного слова определяет его синоним.
    
    Формат входных данных
    На вход программе подается количество пар синонимов n. Далее следует n строк, каждая строка содержит два слов�